<?php

// 27/8 ทำการเชื่อมต่อฐานข้อมูล
require("dbconnect.php");


// 27/6 ทำการรับค่าเก็บไว้ในตัวแปร 
// 27/7 และทำการส่งมาในรูปแบบ method="POST"
                // ชื่อค่าที่ส่งมา
$emp_id = $_POST["emp_id"];

// 27/9 ลบข้อมูลด่วยคำสั่ง sql 
//     ทำการลบข้อมูลในตาราง   โดยมีเงื่อนไขและชื่อ c มีค่าเท่ากับ id ที่ส่งมา
$sql = "DELETE FROM employees WHERE emp_id = $emp_id";

// 27/8 ก็ทำการสั่งรัน
$result = mysqli_query($con,$sql);

// 27/9 เช็คเงื่อนไข
if($result){
    //ระบุการส่งข้อมูลแล้วให้กลับไปในหน้าไหน
    header("location:index.php");
    //และให้สิ้นสุดการทำงานของตัวโปรแกรม
    exit(0);
}else{
    echo "เกิดข้อผิดพลาด";
}



?>